//void main() {
  //String birinchi= ('sabak');
//биринчи форматы же тиби ;екинчи переменныйдын аты; учунчу барабар;
//тортунчу переменныйдын значениясы 
//print(birinchi);
// принтин ичине переменныйдын атын жазабыз;
//}
//тибтердин аталышы;
// string тиби бул тырнакчанын ичиндеги кандай соз болбосун же сандар болбосун буулардын баары string тиби деп аталат;
//intijer тиби бул бутун сан типтери мисалы 7;
 //double тиби бул болчок сан тиби мисалы 7,9;
//dynamic тиби бул универсалдууу тиб баардык тибтерди кабыл ала турган тиб;
//final тиби бул биз берген атты озгортпойт турган тиб;
//const  тиби бул дагы файналга окшош тиб универсалдуу бирок бул толук универсалдуу емес;

void main() {
 

}